app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
  	@stories = Story.all

SELECT "stories".* FROM "stories"
---
  def new
    @stories = Story.all

INSERT INTO "stories" ("title", "author", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
  	@story = Story.new(story_params)
  	if @story.save

UPDATE "stories" SET "author" = ?, "body" = ?, "updated_at" = ? WHERE "stories"."id" = ?
---
  def update
  	if @story.update(story_params)

DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 1]]
---
  def destroy
    @story.destroy

SELECT "stories".* FROM "stories"
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", nil]]
---
  def find_story
    @stories = Story.all
  	@story = Story.find(params[:id])